app/Controllers/UserRoles.php

SELECT *
FROM `userrole`
WHERE `userrole`.`deleted_at` IS NULL
ORDER BY `iduserrole` DESC
---
    public function index(){
        $UserRoleModel = new UserRoleModel();
        $data['roles'] = $UserRoleModel->orderBy('iduserrole', 'DESC')->findAll();