app/Controllers/Users.php

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
ORDER BY `iduser` DESC
---
    public function index(){
        $userModel = new UserModel();
        $data['users'] = $userModel->orderBy('iduser', 'DESC')->findAll();

INSERT INTO `users` (`LoginID`, `Password`, `DisplayName`, `Name`, `SurName`, `Gender`, `EmailID`, `Phone`, `Mobile`, `Address1`, `Address2`, `idCountry`, `idState`, `idCity`, `idTimeZone`, `idLocale`, `Status`, `UserType`, `isSuperAdmin`, `DOB`, `UserRole`, `idUserRole`) VALUES ('_', '', '', '', '', 'Choose...', '', '', '', '', '', '', '', '', 1, 1, 'Active', 'User', 0, '', 'User', '2')
---
    public function store() {
        $userModel = new UserModel();
        $role=explode('_', $this->request->getVar('UserRole'));

        $data = [
            'LoginID' => $this->request->getVar('DisplayName').'_'.$this->request->getVar('Mobile'),//$this->request->getVar('LoginID'),
            'Password' => $this->request->getVar('Password'),
            'DisplayName' => $this->request->getVar('DisplayName'),
            'Name' => $this->request->getVar('Name'),
            'SurName' => $this->request->getVar('SurName'),
            'Gender' => $this->request->getVar('Gender'),
            'EmailID'  => $this->request->getVar('EmailID'),
            'Phone'  => $this->request->getVar('Phone'),
            'Mobile'  => $this->request->getVar('Mobile'),
            'Address1'  => $this->request->getVar('Address1'),
            'Address2'  => $this->request->getVar('Address2'),
            'idCountry'  => $this->request->getVar('idCountry'),
            'idState'  => $this->request->getVar('idState'),
            'idCity'  => $this->request->getVar('idCity'),
            'idTimeZone'  => 1,
            'idLocale'  => 1,
            'Status'  => 'Active',
            'UserType'  => 'User',
            'isSuperAdmin'  => 0,
            'DOB'  => $this->request->getVar('DOB'),
            'UserRole'  => $role[0],
            'idUserRole'  => $role[1],
        ];
        $userModel->insert($data);